namespace Homework_Module_3.Task10_Parenthesized_expression;

public class ParenthesizedExpression
{
    public void Run()
    {
        //Дана строка из символов '(' и ')'. Определить, является ли она корректным скобочным выражением.
        //Определить максимальную глубину вложенности скобок.
        //Текущая глубина равняется разности открывающихся и закрывающихся скобок в момент подсчета каждого символа.
        //К символу в строке можно обратиться по индексу

        //Пример “(()(()))” - строка корректная и максимум глубины равняется 3.
        //Пример некорректных строк: "(()", "())", ")(", "(()))(()"
        
        
    }
}